app/controllers/doubles_controller.rb

  def index
    @doubles = Double.all
---
SELECT * FROM "doubles"

  def show
    @double = Double.find(params[:id])
---
SELECT * FROM "doubles" WHERE ("doubles"."id" = 1)

  def edit
    @double = Double.find(params[:id])
---
SELECT * FROM "doubles" WHERE ("doubles"."id" = 1)

  def create
    @double = Double.new(params[:double])
    respond_to do |format|
      if @double.save!
---
INSERT INTO "doubles" ("created_at", "updated_at", "rate", "time") VALUES('2011-03-01 00:38:45', '2011-03-01 00:38:45', 10, 2)

  def update
    @double = Double.find(params[:id])

    respond_to do |format|
      if @double.update_attributes(params[:double])
---
SELECT * FROM "doubles" WHERE ("doubles"."id" = 1)
UPDATE "doubles" SET "rate" = 33, "updated_at" = '2011-03-01 01:09:47', "time" = 33 WHERE "id" = 1